In [3]:
import numpy as np
import pandas as pd

In [4]:
A = [1,2,3,4]
B = [5,6,7,8]
C = [9,0,1,2]
D = [3,4,5,6]
E = [7,8,9,0]

In [5]:
df = pd.DataFrame([A,B,C,D,E], ['A','B','C','D','E'], ['W','X','Y','Z'])

In [6]:
df

   W  X  Y  Z
A  1  2  3  4
B  5  6  7  8
C  9  0  1  2
D  3  4  5  6
E  7  8  9  0

In [7]:
df['P'] = df['Y']+df['W'] #Criar colunas adicionais

In [8]:
df['W']['D'] #Para acessar elementos de um dataframe df[IndiceColuna][IndiceLinha]

3

In [11]:
df.loc['D'] #Acessa determinada linha

W    3
X    4
Y    5
Z    6
P    8
Name: D, dtype: int64

In [13]:
df.iloc[1] #Acessa determinada linha a partir do indice

W     5
X     6
Y     7
Z     8
P    12
Name: B, dtype: int64

In [108]:
df

   W  X  Y  Z   P
A  1  2  3  4   4
B  5  6  7  8  12
C  9  0  1  2  10
D  3  4  5  6   8
E  7  8  9  0  16

In [109]:
df.drop('E', inplace=False) #Deleta linha especificada / inplace remove permanentemente caso esteja True

   W  X  Y  Z   P
A  1  2  3  4   4
B  5  6  7  8  12
C  9  0  1  2  10
D  3  4  5  6   8

In [115]:
df.drop(labels = ['W','Y'], axis = 1, inplace = False) #Deletar coluna informando drop('Coluna(s)', '1 para eixo y')

   X  Z   P
A  2  4   4
B  6  8  12
C  0  2  10
D  4  6   8
E  8  0  16

In [120]:
df

   W  X  Y  Z   P
A  1  2  3  4   4
B  5  6  7  8  12
C  9  0  1  2  10
D  3  4  5  6   8
E  7  8  9  0  16